/*
 * Copyright(c)2018-2020, 赵鹏阳
 * 项目名称:Yearn 文件名称:DoNothingDemo.java
 * Date:2020/1/1 下午9:21
 * Author: 赵鹏阳
 */

package com.zpy.demo.burns;

import com.zpy.common.TestBase;

/**
 * Created by zpy on 2019/6/20.
 */
public class DoNothingDemo {//extends TestBase {
    /*
    语料：
    如果别人总是逼你做事，总是说“你应该”，你就更不想做了。因为如果有人强迫你做事，很可能会激起你的自卫意识、逆反心理，你会为了保留尊严而回绝。可这却是个矛盾问题——你往往会伤害自己。
    当别人逼你做的事其实是对你有利的时候，你将陷入两难境地。如果你回绝，结果是除了为难他们之外，你丧失了做这件事的好处；如果你照办，你又不甘心。因为只要你屈从于这些强迫性的命令，你就会觉得受制于人，颜面尽失。没人喜欢被胁迫。
    解除戒备法可以解决这样的问题。它的关键在于你同意要求你的人的意见，但你得告诉他，你听他的话只是因为你先做了同样的决定，并不是因为屈从于他的命令。

    问题：
    - 为什么逼别人做事，往往起不到效果？

    - 自尊心强的人和自尊心弱的人，哪个更不喜欢被逼？
    自尊心强的人更想保留尊严，
    - 自尊心强的人，可能有什么不好的结果？

    - 为什么解除戒备法可以解决这样的问题？这个方法是怎么避免自尊心受损的？

     */
}
