/*
 * Copyright(c)2018-2020, 赵鹏阳
 * 项目名称:Yearn 文件名称:NewConcept2.java
 * Date:2020/1/1 下午9:21
 * Author: 赵鹏阳
 */

package com.zpy.demo.newConcept;

import com.zpy.common.TestBase;

/**
 * Created by zpy on 2019/6/5.
 */
public class NewConcept2 {//extends TestBase {

    /*
    第1课：
    Why did the writer complain to the people behind him?

上星期我去看戏。我的座位很好，戏很有意思，但我却无法欣赏。一青年男子与一青年女子坐在我的身后，大声地说着话。我非常生气，因为我听不见演员在说什么。我回过头去怒视着那一男一女，他们却毫不理会。最后，我忍不住了，又一次回过头去，生气地说：“我听不见演员说话了！”
    “不关你的事，”那男的毫不客气地说，“这是私人间的谈话！”


    1.抱怨：说自己的利益收到损害=》欲望不能满足
    2.看戏：通过看、听演员的表演来获得乐趣。
    =》 因： 听演员  果：欲望、目的：获得乐趣
定理：因不成立，则果不成立
=》不能听见演员，那么获得乐趣的欲望不能满足
& 说“我听不见演员说话”
表达的内容的推论也是表达的内容
=》说获得乐趣的欲望不能满足
=》抱怨

为什么抱怨？=》为什么表达？
当欲望不能满足时，人一般喜欢表达欲望没有满足
& 从一般到特例
p:当作者的欲望不能满足时，他很可能表达出来（抱怨）
                            Is
                        事实：他抱怨
事实带入一般，时态统一，作者的欲望没有得到满足


     */
}
